# **Data Cleaning:**
Summarize what we did in Excel, and some stuff moving into python
- dawg i had to manually remove values because 1). the list is so small, 2). not that hard as a result 3). excel/python would take more time

In [52]:
# further data cleaning in pandas
import pandas as pd

table6 = pd.read_csv("Matthew's Data/Table6.csv")
table8 = pd.read_csv("Matthew's Data/Table8.csv")
table9 = pd.read_csv("Matthew's Data/table9.csv")

# create list of all strings that contain the names of communities in table 8
community_names = table8["Community"].unique().tolist()

# filter the csv based on if it exists in the observed commmunities
table9_filtered = table9[table9["Area Name"].isin(community_names)]

# display populations (alphabetical order)
table9_filtered.sort_values("Area Name")

# clean again 
#print(len(community_names))
#print(len(table9_filtered.index))
#for i in community_names:
    #if not table9_filtered["Area Name"].str.contains(i).any():
        #print(i, "is not in here")

       Area Name Type  2021  2022
308    Athabasca    T  2842  2827
330        Banff    T  8574  9347
296     Barrhead    T  4437  4503
26       Bassano    T  1250  1255
409  Beaverlodge    T  2342  2371
..           ...  ...   ...   ...
183   Vegreville    T  5848  5819
190    Vermilion    T  4078  3978
59        Vulcan    T  1809  1825
131   Wainwright    T  6860  6741
300     Westlock    T  5053  5022

[67 rows x 4 columns]

For this data set, it was at some point much easier to clean manually than it was to use excel or python, due to the fact that in this check, less than 15 were absent due to some error, and was as a result, so using ctrl + f and manually editing was not (in general, it isn't a practical solution but here is somehow less time consuming than using python/excel)

In [ ]:
# TODO fix tables 2b-2 and 2b
# TODO start working on faceted graph
# TODO for population before graph, make as ranges

Ok so here is the shit that I am going to do for my part, please listen to the checklist ANALYSIS
- make **Faceted Graph** for table 8 (and 6 now)
    - write observations if any
    - **MAINLY, WHAT RELATION BETWEEN RENT AND VACANCY IS THERE??**
        - **HOW DOES THIS CHANGE BETWEEN COMMUNITY SIZES??**

- <u>Sampled Towns</u> --> how might these be useful?
    - Banff, Drumheller, Slave Lake, 
        - *State why these are good representatives in the sample for the whole communities* in the notebook
            - sdf
    - Analyze overall Rental Range from table 2b and vacancy rates?
    - **AT LEAST 2 VISUALS/ANALYSIS WE WANT TO MAKE FROM THE SAMPLED TOWNS STUFF**

New changes
- removed commas in thousands from Table 8 --> can read as numerical values now
- removed "Overall Vacancy Rates" from Table 8, since this is covered in table 6 and is more accurate there, just need the weighted rents between years in table 8\
- added "population" which we want to analyze how town population sizes might also be related to costs and shit
    - add to faceted graph as an outer variable

-------

# **Visualizations + Analysis:**

dddddddd

In [61]:
range = table9_filtered["2022"].max()
range

'998'

In [56]:
faceted_data = table8.copy()
faceted_data

      Community    Unit Type  2021 Weighted Rent  2022 Weighted Rent
0     Athabasca  1 - Bedroom                 840                 852
1     Athabasca  2 - Bedroom                 912                 931
2     Athabasca  3 - Bedroom                1026                 980
3     Athabasca     Bachelor                 706                 719
4         Banff  1 - Bedroom                1318                1435
..          ...          ...                 ...                 ...
247  Wainwright     Bachelor                 450                 434
248    Westlock  1 - Bedroom                 775                 768
249    Westlock  2 - Bedroom                 881                 881
250    Westlock  3 - Bedroom                 972                 963
251    Westlock     Bachelor                 613                 525

[252 rows x 4 columns]

In [ ]:
# faceted chart
import plotly.express as px

faceted_graph = px.line(faceted_data, )
faceted_graph.show()